[M_ArmsDealer MissionDefinition]
MissionDescription="Zed has placed several orders with a prominent arms dealer named Varnell. These orders have just arrived in [place]The Highlands[-place], and Zed needs you to pick them up before they go bad. How exactly weapons can ''go bad,'' Zed neglected to explain."
TurnInDescription="Since arriving on Pandora, you've been mauled, shot, stabbed, and frozen...and yet, that pun hurt worst of all."
MissionSummary="Collect Zed's packages in the allotted time."
TeaserText="If you can drive fast and not ask a lot of silly questions like, ''Why am I doing this?'' or ''What is that smell?'' Zed has a job for you."
